{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "CLIPTextModel",
    "parent_library": "transformers.models.clip.modeling_clip"
  },
  "base_model_name_or_path": "C:\\Users\\Avneet Singh\\.cache\\huggingface\\hub\\models--stabilityai--stable-diffusion-2-1-base\\snapshots\\5ede9e4bf3e3fd1cb0ef2f7a3fff13ee514fdf06\\text_encoder",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 1,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v_proj",
    "k_proj",
    "q_proj",
    "out_proj"
  ],
  "task_type": null,
  "use_rslora": false
}